scripts/paper2/sweep/CaseOrig/0.orig/Ne
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Ne;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.5; 


boundaryField
{
    PNe
    {
        type            zeroGradient;
    }
    PPe
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    Outlet1
    {
        type            zeroGradient;
    }
    Outlet2
    {
        type            zeroGradient;
    }
    Inlet1
    {
        type            zeroGradient;
    }
    Inlet2
    {
        type            zeroGradient;
    }
        OWall
    {
	type 		zeroGradient;
        
    }
    Walls
    {
	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
