scripts/paper2/sweep/CaseOrig/system/controlDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     currentTransport;

startFrom       startTime;

startTime       STARTFROM;

stopAt          endTime;

endTime         ENDTIME;

deltaT          DELTAT;

writeControl    adjustableRunTime;

writeInterval   WRITEINTERVAL;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep 	ADJUSTTIME;
maxCo 		MAXCO;
maxDeltaT	MAXDT;


functions
{

	PWall_Ne
	{
	name    PNe;
	fields  (INe UNe);

	operation areaAverage;

	type            surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");

	writeControl    runTime;
	writeInterval   WRITEINTERVAL;

	writeFields     false;
	log             false;

	regionType  patch;
	}
	PWall_Pe
	{
	name    PPe;
	fields  (IPe UPe);

	operation areaAverage;

	type            surfaceFieldValue;
	libs            ("libfieldFunctionObjects.so");

	writeControl    runTime;
	writeInterval   WRITEINTERVAL;

	writeFields     false;
	log             false;

	regionType  patch;
	}
	
	line
    {
        type            sets;
        libs            (sampling);
        enabled         true;
	    writeControl    runTime;
	    writeInterval   WRITEINTERVAL;

        interpolationScheme cellPoint;
        setFormat       raw;

        fields          (alpha.gas);

        sets
        {
            s05
            {
                type            midPoint;
                axis            distance;
                start           ( 5e-3 0 15e-3 );
                end             ( 5e-3 4.45e-3 15e-3 );
            }
            s15
            {
                type            midPoint;
                axis            distance;
                start           ( 15e-3 0 15e-3 );
                end             ( 15e-3 4.45e-3 15e-3 );
            }
            s25
            {
                type            midPoint;
                axis            distance;
                start           ( 25e-3 0 15e-3 );
                end             ( 25e-3 4.45e-3 15e-3 );
            }
            s35
            {
                type            midPoint;
                axis            distance;
                start           ( 35e-3 0 15e-3 );
                end             ( 35e-3 4.45e-3 15e-3 );
            }
            s45
            {
                type            midPoint;
                axis            distance;
                start           ( 45e-3 0 15e-3 );
                end             ( 45e-3 4.45e-3 15e-3 );
            }
            s55
            {
                type            midPoint;
                axis            distance;
                start           ( 55e-3 0 15e-3 );
                end             ( 55e-3 4.45e-3 15e-3 );
            }
            s65
            {
                type            midPoint;
                axis            distance;
                start           ( 65e-3 0 15e-3 );
                end             ( 65e-3 4.45e-3 15e-3 );
            }
            s75
            {
                type            midPoint;
                axis            distance;
                start           ( 75e-3 0 15e-3 );
                end             ( 75e-3 4.45e-3 15e-3 );
            }
            s85
            {
                type            midPoint;
                axis            distance;
                start           ( 85e-3 0 15e-3 );
                end             ( 85e-3 4.45e-3 15e-3 );
            }
            s95
            {
                type            midPoint;
                axis            distance;
                start           ( 95e-3 0 15e-3 );
                end             ( 95e-3 4.45e-3 15e-3 );
            }
        }	
	}
}
// ************************************************************************* //
