scripts/paper2/sweep/CaseOrig/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
	nAlphaCorr	3;
	nAlphaSubCycles	2;
	
        solver          PBiCGStab;
        preconditioner	FDIC;
        
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }


    "p(|_rgh)"
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        DIC;
        nCellsInCoarsestLevel 20;
    }

    "p(|_rgh)Final"
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
        minIter         1;
    }


    "C.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-15;
        relTol          0;
    }
    "(UPe|UNe)"
    {
        solver          PBiCGStab;
        preconditioner  FDIC;
        tolerance       1e-7;
        relTol          0.1;
        minIter         1;
    }
    "(UNe|UPe)Final"
    {
        $UPe;
        relTol          0;
    }
    Ue
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.0;
    }
    UeFinal
    {
        //solver          smoothSolver;
        //smoother        GaussSeidel;
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.0;
    }
        UFinal
    {
        //solver          smoothSolver;
        //smoother        GaussSeidel;
                smoother        GaussSeidel;
        solver          GAMG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.0;
    }

}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 5;
    nOuterCorrectors    2;

	pRefPoint	(0 0.00213 0);
	pRefValue	0;
}
AlkaWE
{
	potentialCorrections	1;
	speciesCorrections	1;
	outerChemicalCorrections 1;
}
relaxationFactors
{
    equations
    {
        ".*"           0.75;
        "C*"		0.5;
        UNe		0.75;
        UPe		0.75;
        Ue		0.75;
        p		0.3;
        p_rgh		0.3;
        U		0.7;
    }
}


// ************************************************************************* //
